[{".GOV Domain Registration SystemsAccess to Data systemsAgency support tool Business Intelligence ServicesCollaboration Tools (SharePoint)Collect, analyze, maintain and share dataConsulate Database (VISA)Cybersecurity MonitoringCybersecurity tools\/solutionsData RepositoryDecision making toolDiplomatic and Incident Response CommunicationsEmail services and\/or internet accessEmergency management SystemEmergency response plans and personnelEnterprise resource planningExplosive Threat ProfilesFinancial [Agency Level]Financial [National Level]Financial System Fingerprint DatabaseGeneral Support System (GSS) [WAN \/ Mainframe \/ Gateway]General System and Infrastructure SupportHuman Resource (HR)Identity and Access Management (IDAM) \/ Identity, Credential, and Access Management (ICAM) \/ Authentication \/ Active DirectoryImmigration (most)Imports-Exports Compliance [Port of Entry]Internet-Based \/ Web-Based (Front-Facing Applications)IT support servicesLaw enforcement servicesLocal Area Network (LAN)Loss of Life Potential Manage medical related dataOffice of the Inspector General (OIG)OtherPayroll Physical Access Control Systems (PACS)Procurement systemsRadio communicationsReal-time data alerts and updatesReal-time imagerySecurity Clearance \/ Background Investigations Security Operations Center (SOC)Supervisory Control and Data Acquisition (SCADA) – electrical systemsSupport to Vulnerability  AssessmentsTactical communicationsTrusted Internet Connection (TIC)Weather warning and analysis servicesWeb based monitoring systemOther ":356,"Cyber Security Support":0,"Cyber Security SupportFinancial Information SupportMedical\/health care SupportData storage and managementLegal ServicesLaw enforcement servicesVeteran support servicesImmigration servicesData Access and SharingNASA and space servicesAccess controlVisitor managementVideo surveillancePII data controlCommunicationEmergency dispatchIT Support serviceData center\/warehouseEmergency AlertsReal Time data accessPhysical SecurityWeather Display and alertsPayroll related ServicesWeb Based MonitoringProvides infrastructure servicesOther [Free Text]":0,"Federal Agencies employees":0,"Federal Agencies employeesEmergency responders\/emergency managersLocal, State and Government personnelFederal Employees and designated contractorsMembers of the general publicNASA (Missions, Services and\/or employees)Federal, Local, State Law EnforcementInternal USDA AgenciesVA Personnel, VA Contractors, Veterans, Veterans' family membersNOAA employees and contractorsAviation workersFederal Credit Unions and other Federal finical personnelInternal and External StakeholdersPotential federal employeesPublic officialsBorder PatrolEconomic AnalystsInfrastructure Support PersonnelSLTT OrganizationsFederal, State, Local, Tribal, and Territorial communitiesMedical and Healthcare PersonnelVisa applicantsMilitary and Defense Personnelother Government systemsother public systemsInternal agency usersExternal agency usersOther [Free Text]None":355,"< 5 years> 6 – 10 years > 10 – 15 years > 15 – 20 years > 20 – 30 years > 30 – 40 years> 40 years":325,"1. Yes2. No3. Unknown":162,"Legacy codebase (COBOL, MUMPS)Lack of or poor documentationLegacy infrastructureAd-hoc infrastructure Hardware or software with no vendor\/manufacturer supportOutdated or inaccurate inventoryLimited FunctionalityOther [Free Text]":326,"1. Yes":6,"DATE (MM\/YYYY)":0,"1. Free text":0,"1. Cloud2. Mainframe3. GSS4. Web Application5. Application Platform6. ICS\/SCADA7. Client\/Server8. Other [Free Text]":153,"1. Paas":0,"1. Paas2. SaaS3. IaaS4. Hybrid5. Other [Free Text]":154,"1. Free Text":0,"1. GSS2. Web Application3. Both4. Unknown5. Neither":0,"1. Web Browser: Free Text2. Web Application Server: Free Text3. Database: Free Text4. Unknown":0,"HTMLCSSJSPHPJavaRuby on RailsSmyfony Angular JS React.jsCake PHPAsp.netNode.jsMeteorLaravelEmberDjangoExpressSpringFlaskDrupalWordPressBootstrapweb2pyTurboGearsSinatraZend FrameworkNot Listed\/Other":327,"Microsoft Windows, Apple MacOS, iOS, Ubuntu, CentOS, Unix, Android, Windows 10(and EOS Win10), MS-DOS, Windows Vista, Linux Kernel, HyperVisor (such as VMware), etc.Other (Free Text)":328,"1. Upstream2. Downstream3. Both":161,"1. Government Owned – Government Operated (GoGo)2. Government Owned – Contractor Operated (GoCo)3. Contractor Owned – Contractor Operated, (CoCo)4. Federally Funded Research and Development Center (FFRDC)5. Other (Free Text)":155,"1. Federal Employees2. Federal employees and direct support contractors3. Contractors":156,"1. Encryption of data at rest\n2. Encryption of data in transit\n3. Least privilege principles\n4. Application Allowlisting (whitelisting)\n5. Other (Free Text)\n6. Unknown":0,"1. Security Operations Center (SOC) as a Service such as Asset Management2. Awareness and Training3. Detection Processes4. Governance: Information Protection Processes and Procedures;5. Protective Technology6. Risk Assessment7. Security Continuous Monitoring8. Supply Chain Risk Management":0,"1. Continuous Diagnostics and Mitigation (CDM)2. Protective DNS (pDNS)3. Vulnerability Disclosure Program (VDP)4. Other (Free Text)5. Unknown6. No":0,"1. Resulted in unscheduled downtime\/unavailability2. Required outside incident response support  in the last 12 months":0,"1. Integer":0,"DOJ(1) - Advise and Represent the PresidentDOJ(2) - Protect Senior Officials and the CourtsDOJ(3) - Perform Critical Legal ReviewsDOJ(4) - Fight Terrorism and EspionageDOJ(5) - Conduct Law Enforcement ActivitiesDOJ(6) - Operate Federal PrisonsDHS(1) - Secure and Manage the BordersDHS(2) - Secure Critical Infrastructure and CyberspaceDHS(3) - Protect National LeadersDHS(4) - Provide Domestic Situational AwarenessDHS(5) - Enforce Homeland Security Laws and RegulationsDHS(6) - Coordinate Continuity and Incident ResponseDHS(7) - Coordinate Disaster RecoveryGSA(1) - Lead Government ReconstitutionDOD(1) - Advise on National Defense PolicyDOD(2) - Defend the Security of the United StatesDOD(3) - Collect, Analyze, and Disseminate IntelligenceDOD(4) - Promote National SecurityDOD(5) - Conduct Domestic Emergency ResponseDOS(1) - Formulate Foreign Affairs PolicyDOS(2) - Maintain Foreign Diplomatic RelationsDOS(3) - Maintain International Situational AwarenessDOS(4) - Support U.S.Citizens OverseasCIA(1) - Produce Timely Intelligence ReportsCIA(2) - Collect Intelligence CIA(3) - Conduct Covert OperationsDOI(1) - Provide Emergency Response on Federal LandsDOI(2) - Provide Law Enforcement on Federal LandsDOI(3) - Provide National Emergency ResponseDOI(4) - Maintain Relations with Insular Areas and TribesDOI(5) - Provide Water and Electric PowerDOE(1) - Ensure Nuclear Materials SafetyDOE(2) - Respond to Nuclear IncidentsDOE(3) - Manage Energy InfrastructureDOC(1) - Prevent Export Control ViolationsDOC(2) - Provide Satellite ImageryDOC(3) - Provide Meteorological ForecastsDOC(4) - Maintain Operational Federal CommunicationsTREAS(1) - Safeguard the Economy and the Financial SystemTREAS(2) - Use Financial Measures to Counter National Security ThreatsTREAS(3) - Manage Government FinancesTREAS(4) - Promote International Financial StabilityUSDA(1) - Ensure Food SafetyUSDA(2) - Provide Emergency Food SuppliesUSDA(3) - Fight Forest FiresUSDA(4) - Provide Safety and Security on Public LandsFRS(1) - Conduct Monetary PolicyFRS(2) - Maintain Financial System StabilityFRS(3) - Regulate BankingFRS(4) - Provide Financial ServicesDOT(1) - Ensure Defense Transportation InfrastructureDOT(2) - Respond to Transportation DisruptionsDOT(3) - Operate the National Airspace SystemHHS(1) - Monitor and Respond to Health Emergencies and RisksHHS(2) - Oversee Safety of Medical and Food ProductsHHS(3) - Provide Medical Care and ServicesNRC(1) - Maintain Awareness and Respond to U.S. Civilian Nuclear EventsNRC(2) - Ensure Safe U.S. Civilian Nuclear OperationsFCC(1) - Maintain Operational CommunicationsEPA(1) - Respond to Environmental and Health ThreatsCFTC(1) - Monitor Commodity Futures MarketsSSA(1) - Provide Social Security ServicesSEC(1) - Regulate Securities MarketsOPM(1) - Provide Human Capital ServicesNASA(1) - Operate SatellitesVA(1) - Provide Medical CareODNI(1) - Collect, Analyze, and Provide IntelligenceNARA(1) - Publish the Federal RegisterUSPS(1) - Deliver Postal ServicesNCUA(1) - Maintain Solvent Credit Unions":0,"1. HVA does not support a PMEF or MEF. 2. No impact: Essential function is accomplished as intended.3. Work around: Essential function is still fully accomplished but requires documented and trained-to work around procedures. \"Workaround” does not mean patched together actions or “hacks.”  Defined as approved, documented plans that staff already knows. 4. Degraded: Essential function is partially accomplished.  There may be delays in time. There may be omissions of information. There may be parts of functions that cannot be provided.5. Failure: Essential function cannot be accomplished.  Highest impact to mission and function of Agency.":0,"1. Safety2. Environmental3. Financial4. Public Trust5. Other [Free Text]":362,"1. PII2. PHI3. Law Enforcement4. Pre-Release5. IP6. Other [Free Text]":0,"<1K":0,"<1K1K - 100K100K -1M1M - 100M> 100MUnknownN\/A":157,"1-1011-2526-5051-200 201+":158,"1. Transmit2. Receive3. Both":329,"1. Private\/Commercial2. NGO3. FFRDC4. SLTT5. Other":0}]